public/phases/BeaconDAO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-25 Mon 18:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Beacon DAO Roadmap</title>
<meta name="author" content="Dowland Aiello" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../theme/rethink.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Beacon DAO Roadmap</h1>

<div id="outline-container-org8b8fc9c" class="outline-2">
<h2 id="org8b8fc9c"><span class="done DONE">DONE</span> Beacon DAO <code>[2/2]</code></h2>
<div class="outline-text-2" id="text-org8b8fc9c">
<p>
The <b>Beacon DAO</b> is a decentralized autonomous organization implementing the Vision DAO, and a basic system for "bootstrapping" user applications from a minimal starting point. This means that a bare, basic implementation of the <b>Beacon DAO</b> can be released to the public, and be upgraded without any intervention, over time.
</p>

<ul class="org-ul">
<li><i>ETA: Mid-July</i></li>
<li>Assignee: <b>Dowland Aiello</b></li>
</ul>
</div>

<div id="outline-container-org5f88dc9" class="outline-3">
<h3 id="org5f88dc9"><span class="done DONE">DONE</span> DAO Contracts</h3>
<div class="outline-text-3" id="text-org5f88dc9">
<p>
The <b>Beacon DAO</b> implements a one-token-one-share voting system to modify payloads designating code that the <b>Beacon DAO</b> provides for the user. These contracts are available <a href="https://github.com/vision-dao/beacon-dao">here</a>.
</p>
</div>
</div>
<div id="outline-container-org59f8b83" class="outline-3">
<h3 id="org59f8b83"><span class="done DONE">DONE</span> Web UI</h3>
<div class="outline-text-3" id="text-org59f8b83">
<p>
The primary use case of the <b>Beacon DAO</b> is loading further Vision OS modules. This requires executing code on a client's device. The <b>Beacon DAO</b> loader UI, available <a href="https://github.com/Vision-DAO/beacon-dao-loader">here</a>, implements this functionality.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 06/22/2022</p>
<p class="author">Author: Dowland Aiello</p>
<p class="date">Created: 2022-07-25 Mon 18:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
